LEXICON_RU: dict[str, str] = {
    'start': 'Я Шалушай бот 🤖 и я готов помочь вам в образовательных вопросах 👨‍🏫\n\
        По кнопке ниже вы можете перейти в меню🧐',
    'menu': 'Меню:',
    'subjects': 'Предметы:',
    'games': 'Игры:',
    'profile': 'Профиль:\n\n',
    'info': 'О боте',
    'rating': 'Ваш рейтинг: ',
    'registered': 'Дата регистрации: ',
    'choose': 'Орел или решка?',
    'win': 'Вы выиграли!\n\nТекущий рейтинг: ',
    'lose': 'Вы проиграли!\n\nТекущий рейтинг: ',
    'solve': 'Решите следующий пример:\n\n',
    'correct': 'Все верно!\n\nТекущий рейтинг: ',
    'wrong': 'Неверно!\n\nТекущий рейтинг: ',
}

KB_LEXICON_RU: dict[str, str] = {
    'menu': 'Перейти в меню',
    'subjects': 'Предметы',
    'rus': 'Русский язык',
    'maths': 'Математика',
    'lit': 'Литература',
    'it': 'Информатика',
    'chem': 'Химия',
    'phys': 'Физика',
    'games': 'Игры',
    'solve': 'Примеры по математике',
    'coin': 'Монетка',
    'heads': 'Орел',
    'tails': 'Решка',
    'play_again': 'Сыграть еще раз',
    'profile': 'Профиль',
    'info': 'Информация о боте:\n\n'

}

ERROR_LEXICON_RU: dict[str, str] = {
    'database_error': 'Ошибка в базе данных. Повторите попытку позже'
}
