LEXICON_RU: dict[str, str] = {
    'start': 'Я Шалушай бот 🤖 и я готов помочь вам в образовательных вопросах 👨‍🏫\n\
        По кнопке ниже вы можете перейти в меню🧐',
    'menu': '📚 Меню:',
    'subjects': '👨‍🏫 Предметы:',
    'games': '🎮 Игры:',
    'profile': '👤 Ваш профиль:\n\n',
    'info': '🤖 О боте:\n\n',
    'rating': '⭐ Ваш рейтинг: ',
    'registered': '📆 Дата регистрации: ',
    'choose': '👀 Орел или решка?',
    'win': '🎉 Вы выиграли!\n\n🏅 Текущий рейтинг: ',
    'lose': '❌ Вы проиграли!\n\n🏅 Текущий рейтинг: ',
    'solve': '✍ Решите следующий пример:\n\n',
    'correct': '✅ Все верно!\n\n🏅 Текущий рейтинг: ',
    'wrong': '❌ Неверно!\n\n🏅 Текущий рейтинг: ',
}

KB_LEXICON_RU: dict[str, str] = {
    'menu': ' Перейти в меню 📚',
    'subjects': 'Предметы 👨‍🏫',
    'rus': 'Русский язык 🖋',
    'maths': 'Математика 📊',
    'lit': 'Литература 📜',
    'it': 'Информатика 💻',
    'chem': 'Химия 🧪',
    'phys': 'Физика ⚛',
    'games': 'Игры 🎮',
    'solve': 'Примеры по математике 🧮',
    'coin': 'Монетка 👀',
    'heads': 'Орел',
    'tails': 'Решка',
    'play_again': 'Сыграть еще раз 🔁',
    'profile': 'Профиль 👤',
}

ERROR_LEXICON_RU: dict[str, str] = {
    'database_error': '❌ Ошибка в базе данных.\n😔 Повторите попытку позже',
}
